// Local Imports
import type { CvData, MenuItem } from "@/types/navbar";

/*
 * ┌───────────────────────────────┐
 * │        🌟 MenuItem 🌟       │
 * └───────────────────────────────┘
 *
 * ────────────────────────────────
 * Keep calm and code on! 👩‍💻👨‍💻
 */

export const menuItems: MenuItem[] = [
  { title: "About", url: "about" },
  { title: "Publications", url: "publications" },
  { title: "News", url: "news" },
  { title: "Talks", url: "talks" },
  { title: "Awards", url: "awards" },
  { title: "Services", url: "services" },
  { title: "Books", url: "books" },
];

/*
 * ┌───────────────────────────────┐
 * │        🌟 CvData 🌟       │
 * └───────────────────────────────┘
 *
 * ────────────────────────────────
 * Keep calm and code on! 👩‍💻👨‍💻
 */

export const cvData: CvData = {
  title: "CV",
  url: "/cv",
};
